package com.test.six;

/**
 * Created by IntelliJ IDEA.
 *
 * @author : Firewine
 * @version : 1.0
 * @ProgramName: Main4
 * @Create : 2020/3/12
 * @Description :
 * 某公司要建厂投产一种产品，已知该产品共需要k种不同的原材料才能生产，而在这个工厂周围有n个可供建厂的地址，同时这n个位置都生产该产品所需k种原材料中的一种，在这n个位置间存在一些通行的道路，我们可以视这些道路的长度都为1，保证这些位置之间两两都是连通的。
 *
 * 很显然工厂面临一个很严峻的问题，就是原料采集，我们定义采集一种原材料的花费为工厂所在位置到最近的一个该材料的采集点的距离，在一个位置建厂的成本为k种原材料的采集花费之和。
 *
 * 请你对每一个位置都求出其建厂的花费。
 */
/*
5
小仓酷爱射击运动。今天的小仓会进行N轮射击，已知第i次射击，她击中靶心的概率是a[i] -1 。

小仓想知道N轮射击后，偏离靶心次数为 0 ,1 ,2 次的概率分别是多少。



不难证明答案可以表示成一个最简分数 p * q -1。

你需要输出三个p * q -1 对 998244353取模后的结果，以此来表示偏离靶心次数为 0 , 1 , 2时的概率。

其中q-1是q 在模意义下的逆元，满足q-1* q = 1 mod 998244353。

例如1/4, 可以写成748683265，原因是4 * 748683265 % 998244353 = 1,也有且仅有x =  748683265，1 <= x < 998244353满足乘积等于1
 */
public class Main4 {
}
